package data.namesData.rus;

import lombok.Getter;

public class FemaleNamesBankRus {

    @Getter
    static String[] letterA = new String[]{"Анна",
            "Агата",
            "Августа",
            "Алана",
            "Анисья",
            "Августина",
            "Алевтина",
            "Анита",
            "Аврора",
            "Александра",
            "Аниэла",
            "Агата",
            "Алико",
            "Анна",
            "Агата",
            "Агафья",
            "Алина",
            "Антонина",
            "Агафья",
            "Алиса",
            "Анфиса",
            "Аглая",
            "Аглаида",
            "Алла",
            "Анэля",
            "Агнесса",
            "Альберта",
            "Аполлинария",
            "Агния",
            "Альбертина"};


    @Getter
    static String[] letterBE = new String[]{"Барбара",
            "Бернадета",
            "Божена",
            "Беата",
            "Берта",
            "Болеслава",
            "Беатриса",
            "Бибиана",
            "Борислава",
            "Белла",
            "Биргит",
            "Бригитта",
            "Бенедикт",
            "Бирута",
            "Бронислава",
            "Бенедикта",
            "Бланка",
            "Береслава",
            "Богдана"};

    @Getter
    static String[] leterVE = new String[]{"Валентина",
            "Веселина",
            "Виргиния",
            "Валерия",
            "Веста",
            "Вирджиния",
            "Ванда",
            "Вета",
            "Виринея",
            "Варвара",
            "Ветта",
            "Иветта",
            "Вита",
            "Варя",
            "Вивиана",
            "Виталина",
            "Василиса",
            "Вида",
            "Виталия",
            "Виталина"};

    @Getter
    static String[] letterGE = new String[]{"Галатея",
            "Галина",
            "Глафира",
            "Гликерия",
            "Гоар",
            "Говхар",
            "Горица",
            "Гульмира"};

    @Getter
    static String[] letterDE = new String[]{"Дана",
            "Дарерка",
            "Дарья",
            "Дебора",
            "Джанет",
            "Дженифер",
            "Дженна",
            "Джессика"};

    @Getter
    static String[] letterE = new String[]{"Ева",
            "Евгения",
            "Евдокия",
            "Евдоксия",
            "Евлалия",
            "Евлампия",
            "Евпраксия",
            "Екатерина",};

    @Getter
    static String[] letterJE = new String[]{"Жасмин",
            "Жанна",
            "Жозефина"};

    @Getter
    static String[] letterZE = new String[]{"Залина",
            "Зара",
            "Зарема",
            "Зарина",
            "Заря",
            "Земфира",
            "Зиглинда",
            "Зигрида",
            "Зина",
            "Зинаида",
            "Зиновия",
            "Злата",
            "Зоя"};

    @Getter
    static String[] letterI = new String[]{"Ива",
            "Иванна",
            "Ида",
            "Идея",
            "Иветта",
            "Ивонна",
            "Изабелла",
            "Изида",
            "Изольда",
            "Илона",};

    @Getter
    static String[] letterKE = new String[]{
            "Каздоя",
            "Казимира",
            "Калерия",
            "Калида",
            "Калиса",
            "Каллиникия",
            "Каллиста",
            "Кама",
            "Камилла",
            "Кандида"};

    @Getter
    static String[] letterLE = new String[]{"Лада",
            "Лариса",
            "Лаура",
            "Ленина",
            "Леокадия",
            "Леокардия",
            "Леонида",
            "Леонина",
            "Леония",
            "Лиана"};

    @Getter
    static String[] letterM = new String[]{"Мавра",
            "Магдалина",
            "Майя",
            "Макрина",
            "Максима",
            "Малания",
            "Мальвина"};

    @Getter
    static String[] letterNE = new String[]{"Нада",
            "Надежда",
            "Наина",
            "Нана",
            "Наталия",
            "Наталья",
            "Нелли",
            "Ника",
            "Николь",
            "Нина"};

    @Getter
    static String[] letterO = new String[]{"Оксана",
            "Октябрина",
            "Олеся",
            "Оливия",
            "Олимпиада",
            "Олимпиодора",
            "Ольга",
            "Офелия",
            "Октавия"};

    @Getter
    static String[] letterPE = new String[]{"Павлина,",
            "Пелагея,",
            "Полина,",
            "Прасковья",};

    @Getter
    static String[] letterRE = new String[]{"Раиса",
            "Ребекка",
            "Регина",
            "Рената",
            "Римма",
            "Рита",
            "Роза",
            "Розалия",
            "Розалинда",
            "Розина"};

    @Getter
    static String[] letterSE = new String[]{"Сабина",
            "Сабрина",
            "Сара",
            "Сарра",
            "Светлана",
            "Серафима",
            "Сильвия",
            "Соня",
            "Софи",
            "София"};

    @Getter
    static String[] letterTE = new String[]{"Таисия",
            "Тамара",
            "Татьяна",
            "Тереза",
            "Тина"};

    @Getter
    static String[] letterU = new String[]{"Улита",
            "Ульяна",
            "Устинья"};

    @Getter
    static String[] letterFE = new String[]{"Фаина,",
            "Фатима",
            "Фарида",
            "Федора",
            "Федосья",
            "Фёкла"};

    @Getter
    static String[] letterHA = new String[]{"Хаврония",
            "Христина"};

    @Getter
    static String[] letterCE = new String[]{"Цвета",
            "Цветана"};

    @Getter
    static String[] letterCHE = new String[]{"Чеслава",
            "Чулпан"};

    @Getter
    static String[] letterSHA = new String[]{"Шарлотта",
            "Шушаника"};

    @Getter
    static String[] letterYU = new String[]{"Юдифь",
            "Юлиана",
            "Юлия",
            "Юния",
            "Юнона",
            "Юрия",
            "Юстина"};
    @Getter
    static String[] letterYA = new String[]{"Ядвига",
            "Яна",
            "Янина",
            "Ярослава",
            "Ясна"};
}
